app/views/articles/_article.html.erb

SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"
---
 <div><%= pluralize(obj.size, 'article') %> found.</div>

SELECT  1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ? LIMIT 1  [["article_id", 7]]
---
          </div>
          <% if article.categories.any? %>