app/views/articles/index.html.erb

SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"
---
<h1 align="center">Listing All Articles</h1>
  <div><%= pluralize(@articles.size, 'article') %> found.</div>