app/views/articles/show.html.erb

          </li>
          <li><small><%= pluralize(@article.user.articles.count, "article") if @article.user.articles %></small><li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]


      <% if @article.categories.any? %>
---
SELECT  "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ?  ORDER BY "categories"."id" ASC LIMIT 1  [["article_id", 58]]
SELECT  1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ? LIMIT 1  [["article_id", 45]]