app/views/users/_user.html.erb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
 <div><%= pluralize(obj.size, 'user') %> found.</div>