app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"
---
def index
  @articles = Article.paginate(page: params[:page], per_page: 5)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "articles" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Another article"], ["description", "testing validations"], ["user_id", 2], ["created_at", "2016-07-27 07:03:31.824320"], ["updated_at", "2016-07-27 07:03:31.824320"]]
---
def create
  #render plain: params[:article]
  @article = Article.new(article_params)
  @article.user = User.first  #HARDCODED User
  if @article.save