app/controllers/categories_controller.rb

  def index
    @categories = Category.paginate(page: params[:page], per_page: 5)
---
SELECT  "categories".* FROM "categories" LIMIT 5 OFFSET 0