app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories"  ORDER BY name LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "categories"
---
  def index
    @categories = Category.order("name").paginate(page: params[:page], per_page: 5)

SELECT  "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ? LIMIT 5 OFFSET 0  [["category_id", 1]]
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 2]]
---
  def show
    @category_articles = @category.articles.paginate(page: params[:page], per_page: 5)