app/controllers/users_controller.rb

def destroy
  @user = User.find(params[:id])
  @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 8]]