app/controllers/users_controller.rb

def index
    @users = User.paginate(page: params[:page], per_page: 5)
---
SELECT  "users".* FROM "users"  ORDER BY username desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users"

def update
  if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "hello@yadoo.co"], ["password_digest", "$2a$10$INUPhd0yIrl57pZheTYVDu/TONFB1urhKV.P4YIUKVHSTY7FqkHDq"], ["updated_at", "2016-07-29 02:58:45.177153"], ["id", 2]]