app/views/categories/_category.html.erb

 <div><%= pluralize(obj.size, 'category') %> found.</div>
---
SELECT COUNT(*) FROM "categories"